#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the init file, and if so, automatically exports the configuration here to the associated output files.
Must be evaluated at least once.

#+begin_src emacs-lisp
  (defun org-babel-tangle-config ()
    (when (string-equal (file-name-nondirectory (buffer-file-name)) "init.org"))
      (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle)
	(message "%s tangled" buffer-file-name)))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'org-babel-tangle-config)))
#+end_src

#+RESULTS:
| (lambda nil (add-hook 'after-save-hook #'org-babel-tangle-config)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] |

